# Pandas for Data Science
* [Pandas](#0)
* [Pandas Data Structure](#1)
* [Input/Output](#2)
* [Pandas Help](#3)
* [Selection](#4)
* [Dropping](#5)
* [Sort and Rank](#6)
* [Retrieving Series/DataFrame Information](#7)
* [Applying Functions](#8)
* [Data Alignment](#9)

<a id="0"></a>
## Pandas
![Title](0.png)

In [1]:
import pandas as pd

<a id="1"></a>
## Pandas Data Structure
![Title](1.png)

In [3]:
series = pd.Series([10,20,30], index = ["c1","c2","c3"])
series

c1    10
c2    20
c3    30
dtype: int64

In [9]:
data = {"Football_team":["barcelona", "real_madrid"],
        "Footballer":["messi","ramos"],
        "money":[30.0,20.0]}
df = pd.DataFrame(data, columns=["Football_team", "Footballer","money" ])
df

  Football_team Footballer  money
0     barcelona      messi   30.0
1   real_madrid      ramos   20.0

<a id="2"></a>
## Input/Output
![Title](2.png)

In [10]:
data = {"Football_team":["barcelona", "real_madrid"],
        "Footballer":["messi","ramos"],
        "money":[30.0,20.0]}
df = pd.DataFrame(data, columns=["Football_team", "Footballer","money" ])
df

  Football_team Footballer  money
0     barcelona      messi   30.0
1   real_madrid      ramos   20.0

In [19]:
df.to_csv("first.csv")
df1 = pd.read_csv("first.csv",index_col = 0)
df1

  Football_team Footballer  money
0     barcelona      messi   30.0
1   real_madrid      ramos   20.0

<a id="3"></a>
## Pandas Help
![Title](3.png)

In [20]:
help(pd.Series.loc)

Help on property:

    Access a group of rows and columns by label(s) or a boolean array.

    ``.loc[]`` is primarily label based, but may also be used with a
    boolean array.

    Allowed inputs are:

    - A single label, e.g. ``5`` or ``'a'``, (note that ``5`` is
      interpreted as a *label* of the index, and **never** as an
      integer position along the index).
    - A list or array of labels, e.g. ``['a', 'b', 'c']``.
    - A slice object with labels, e.g. ``'a':'f'``.

      .. warning:: Note that contrary to usual python slices, **both** the
          start and the stop are included

    - A boolean array of the same length as the axis being sliced,
      e.g. ``[True, False, True]``.
    - A ``callable`` function with one argument (the calling Series, DataFrame
      or Panel) and that returns valid output for indexing (one of the above)

    See more at :ref:`Selection by Label <indexing.label>`

    See Also
    --------
    DataFrame.at : Access a single value for a row/column label pair
    DataFrame.iloc : Access group of rows and columns by integer position(s)
    DataFrame.xs : Returns a cross-section (row(s) or column(s)) from the
        Series/DataFrame.
    Series.loc : Access group of values using labels

    Examples
    --------
    **Getting values**

    >>> df = pd.DataFrame([[1, 2], [4, 5], [7, 8]],
    ...      index=['cobra', 'viper', 'sidewinder'],
    ...      columns=['max_speed', 'shield'])
    >>> df
                max_speed  shield
    cobra               1       2
    viper               4       5
    sidewinder          7       8

    Single label. Note this returns the row as a Series.

    >>> df.loc['viper']
    max_speed    4
    shield       5
    Name: viper, dtype: int64

    List of labels. Note using ``[[]]`` returns a DataFrame.

    >>> df.loc[['viper', 'sidewinder']]
                max_speed  shield
    viper               4       5
    sidewinder          7       8

    Single label for row and column

    >>> df.loc['cobra', 'shield']
    2

    Slice with labels for row and single label for column. As mentioned
    above, note that both the start and stop of the slice are included.

    >>> df.loc['cobra':'viper', 'max_speed']
    cobra    1
    viper    4
    Name: max_speed, dtype: int64

    Boolean list with the same length as the row axis

    >>> df.loc[[False, False, True]]
                max_speed  shield
    sidewinder          7       8

    Conditional that returns a boolean Series

    >>> df.loc[df['shield'] > 6]
                max_speed  shield
    sidewinder          7       8

    Conditional that returns a boolean Series with column labels specified

    >>> df.loc[df['shield'] > 6, ['max_speed']]
                max_speed
    sidewinder          7

    Callable that returns a boolean Series

    >>> df.loc[lambda df: df['shield'] == 8]
                max_speed  shield
    sidewinder          7       8

    **Setting values**

    Set value for all items matching the list of labels

    >>> df.loc[['viper', 'sidewinder'], ['shield']] = 50
    >>> df
                max_speed  shield
    cobra               1       2
    viper               4      50
    sidewinder          7      50

    Set value for an entire row

    >>> df.loc['cobra'] = 10
    >>> df
                max_speed  shield
    cobra              10      10
    viper               4      50
    sidewinder          7      50

    Set value for an entire column

    >>> df.loc[:, 'max_speed'] = 30
    >>> df
                max_speed  shield
    cobra              30      10
    viper              30      50
    sidewinder         30      50

    Set value for rows matching callable condition

    >>> df.loc[df['shield'] > 35] = 0
    >>> df
                max_speed  shield
    cobra              30      10
    viper               0       0
    sidewinder          0       0

    **Getting values on a DataFrame with an index that has integer labels**

    Another example using integers for the index

    >>> df = pd.DataFrame([[1, 2], [4, 5], [7, 8]],
    ...      index=[7, 8, 9], columns=['max_speed', 'shield'])
    >>> df
       max_speed  shield
    7          1       2
    8          4       5
    9          7       8

    Slice with integer labels for rows. As mentioned above, note that both
    the start and stop of the slice are included.

    >>> df.loc[7:9]
       max_speed  shield
    7          1       2
    8          4       5
    9          7       8

    **Getting values with a MultiIndex**

    A number of examples using a DataFrame with a MultiIndex

    >>> tuples = [
    ...    ('cobra', 'mark i'), ('cobra', 'mark ii'),
    ...    ('sidewinder', 'mark i'), ('sidewinder', 'mark ii'),
    ...    ('viper', 'mark ii'), ('viper', 'mark iii')
    ... ]
    >>> index = pd.MultiIndex.from_tuples(tuples)
    >>> values = [[12, 2], [0, 4], [10, 20],
    ...         [1, 4], [7, 1], [16, 36]]
    >>> df = pd.DataFrame(values, columns=['max_speed', 'shield'], index=index)
    >>> df
                         max_speed  shield
    cobra      mark i           12       2
               mark ii           0       4
    sidewinder mark i           10      20
               mark ii           1       4
    viper      mark ii           7       1
               mark iii         16      36

    Single label. Note this returns a DataFrame with a single index.

    >>> df.loc['cobra']
             max_speed  shield
    mark i          12       2
    mark ii          0       4

    Single index tuple. Note this returns a Series.

    >>> df.loc[('cobra', 'mark ii')]
    max_speed    0
    shield       4
    Name: (cobra, mark ii), dtype: int64

    Single label for row and column. Similar to passing in a tuple, this
    returns a Series.

    >>> df.loc['cobra', 'mark i']
    max_speed    12
    shield        2
    Name: (cobra, mark i), dtype: int64

    Single tuple. Note using ``[[]]`` returns a DataFrame.

    >>> df.loc[[('cobra', 'mark ii')]]
                   max_speed  shield
    cobra mark ii          0       4

    Single tuple for the index with a single label for the column

    >>> df.loc[('cobra', 'mark i'), 'shield']
    2

    Slice from index tuple to single label

    >>> df.loc[('cobra', 'mark i'):'viper']
                         max_speed  shield
    cobra      mark i           12       2
               mark ii           0       4
    sidewinder mark i           10      20
               mark ii           1       4
    viper      mark ii           7       1
               mark iii         16      36

    Slice from index tuple to index tuple

    >>> df.loc[('cobra', 'mark i'):('viper', 'mark ii')]
                        max_speed  shield
    cobra      mark i          12       2
               mark ii          0       4
    sidewinder mark i          10      20
               mark ii          1       4
    viper      mark ii          7       1

    Raises
    ------
    KeyError:
        when any items are not found

<a id="4"></a>
## Selection
![Title](4.png)

In [25]:
df

  Football_team Footballer  money
0     barcelona      messi   30.0
1   real_madrid      ramos   20.0

In [26]:
df["money"]

0    30.0
1    20.0
Name: money, dtype: float64

In [28]:
df[:1]

  Football_team Footballer  money
0     barcelona      messi   30.0

In [29]:
df.iloc[1,1]

'ramos'

In [30]:
df.loc[1,"Footballer"]

'ramos'

In [35]:
#df.ix[1,1]

In [38]:
df

  Football_team Footballer  money
0     barcelona      messi   30.0
1   real_madrid      ramos   20.0

In [39]:
filter_ = 25 > df["money"]
df[filter_]

  Football_team Footballer  money
1   real_madrid      ramos   20.0

In [44]:
series

c1    10
c2    20
c3    30
dtype: int64

In [46]:
series["c2"] = 100
series

c1     10
c2    100
c3     30
dtype: int64

<a id="5"></a>
## Dropping
![Title](5.png)

In [57]:
data = {"Football_team":["barcelona", "real_madrid"],
        "Footballer":["messi","ramos"],
        "money":[30.0,20.0]}
df = pd.DataFrame(data, columns=["Football_team", "Footballer","money" ])
df

  Football_team Footballer  money
0     barcelona      messi   30.0
1   real_madrid      ramos   20.0

In [59]:
df.drop([0],inplace = True)
df

  Football_team Footballer  money
1   real_madrid      ramos   20.0

In [60]:
df.drop(["money"],axis = 1,inplace = True)
df

  Football_team Footballer
1   real_madrid      ramos

<a id="6"></a>
## Sort and Rank
![Title](6.png)

In [61]:
data = {"Football_team":["barcelona", "real_madrid"],
        "Footballer":["messi","ramos"],
        "money":[30.0,20.0]}
df = pd.DataFrame(data, columns=["Football_team", "Footballer","money" ])
df

  Football_team Footballer  money
0     barcelona      messi   30.0
1   real_madrid      ramos   20.0

In [68]:
df = df.sort_values(by = "money")
df

  Football_team Footballer  money
1   real_madrid      ramos   20.0
0     barcelona      messi   30.0

In [69]:
df = df.sort_index()
df

  Football_team Footballer  money
0     barcelona      messi   30.0
1   real_madrid      ramos   20.0

In [71]:
df.rank()

   Football_team  Footballer  money
0            1.0         1.0    2.0
1            2.0         2.0    1.0

<a id="7"></a>
## Retrieving Series/DataFrame Information
![Title](7.png)

In [72]:
df

  Football_team Footballer  money
0     barcelona      messi   30.0
1   real_madrid      ramos   20.0

In [73]:
df.shape

(2, 3)

In [74]:
df.index

Int64Index([0, 1], dtype='int64')

In [75]:
df.columns

Index(['Football_team', 'Footballer', 'money'], dtype='object')

In [76]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 2 entries, 0 to 1
Data columns (total 3 columns):
Football_team    2 non-null object
Footballer       2 non-null object
money            2 non-null float64
dtypes: float64(1), object(2)
memory usage: 64.0+ bytes

In [78]:
df.count() # nan

Football_team    2
Footballer       2
money            2
dtype: int64

In [80]:
df

  Football_team Footballer  money
0     barcelona      messi   30.0
1   real_madrid      ramos   20.0

In [79]:
df.sum()

Football_team    barcelonareal_madrid
Footballer                 messiramos
money                              50
dtype: object

In [82]:
df.max()

Football_team    real_madrid
Footballer             ramos
money                     30
dtype: object

In [89]:
df.index.argmax()

1

In [90]:
df.describe()

           money
count   2.000000
mean   25.000000
std     7.071068
min    20.000000
25%    22.500000
50%    25.000000
75%    27.500000
max    30.000000

In [92]:
df.mean()

money    25.0
dtype: float64

In [93]:
df.median()

money    25.0
dtype: float64

<a id="8"></a>
## Applying Functions
![Title](8.png)

In [94]:
df

  Football_team Footballer  money
0     barcelona      messi   30.0
1   real_madrid      ramos   20.0

In [95]:
f = lambda x: x*2
df.apply(f)

            Football_team  Footballer  money
0      barcelonabarcelona  messimessi   60.0
1  real_madridreal_madrid  ramosramos   40.0

In [97]:
df.applymap(f)

            Football_team  Footballer  money
0      barcelonabarcelona  messimessi   60.0
1  real_madridreal_madrid  ramosramos   40.0

<a id="9"></a>
## Data Alignment
![Title](9.png)

In [124]:
series = pd.Series([10,20,30], index = ["c1","c2","c3"])
series

c1    10
c2    20
c3    30
dtype: int64

In [125]:
s = pd.Series([1,2], index = ["c1","c2"])
s

c1    1
c2    2
dtype: int64

In [126]:
series + s

c1    11.0
c2    22.0
c3     NaN
dtype: float64

In [128]:
s.add(series,fill_value=0)

c1    11.0
c2    22.0
c3    30.0
dtype: float64